       identification division.
       program-id. Assignment1.
       
       environment division.
       configuration section.
       
       data division.
       working-storage section.
       01 out pic x(11) value "Hello World".
       01 giant-ASSIGN pic x.
       procedure division.
        display out.
        goback.
       
       end program Assignment1.
       